Misc/investing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Investing Overview</title>
<!-- 2016-07-18 Mon 22:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link rel="stylesheet" href="/stylesheets/bootstrap.min.css" media="screen" />
<link rel="stylesheet" href="/stylesheets/bootstrap-responsive.min.css" media="screen" />
<link rel="stylesheet" href="/stylesheets/org.css" type="text/css" />
<link rel="SHORTCUT ICON" href="/favicon.png" type="image/x-icon" />
<link rel="icon" href="/favicon.png" type="image/ico" />
</head>
<body>
<div id="preamble" class="status">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-60502031-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

  document.addEventListener('DOMContentLoaded',function() {
      document.getElementById("table-of-contents").onclick = function() {
          var elem = document.getElementById("text-table-of-contents");
          elem.style.display = elem.style.display == "block" ? "none" : "block";
      }
  });
</script>
</div>
<div id="content">
<h1 class="title">Investing Overview</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Learning</a></li>
<li><a href="#sec-2">Reading</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Learning</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://www.investopedia.com/">Investopedia</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Reading</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://www.streetofwalls.com/finance-training-courses/hedge-fund-training/hedge-fund-books/">A huge list of the best books on investing</a>
</li>
<li><a href="http://www.reddit.com/r//comments/166ha8/what_are_rinvestings_favorite_books_future_side/">reddit investing books</a>
</li>
<li><a href="http://www.berkshirehathaway.com/letters/letters.html">Warren Buffett's Shareholder Letters</a>
</li>
<li><a href="http://www.reddit.com/r/investing/comments/18qwso/future_side_bar_link_best_sites_for_news/">websites</a>
</li>
<li><a href="http://www.wallstreetoasis.com/forums/on-the-job-with-simple-as%E2%80%A6-my-research-process">A guide to stock research!</a>
<ul class="org-ul">
<li>A hedge fund analyst explains his stock research process. Full of
excellent links to videos, articles, and books. MUST READ!
</li>
</ul>
</li>
<li><a href="http://www.scribd.com/doc/215096244/Careers-in-Investing">Investing careers guide</a>
<ul class="org-ul">
<li>Bluestem Asset Management gives a detailed breakdown of the
different types of investing jobs and some advice on how to get
them.
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
<script type="text/javascript">
    /* * * CONFIGURATION VARIABLES * * */
    var disqus_shortname = 'finance-wiki';
    
    /* * * DON'T EDIT BELOW THIS LINE * * */
    (function() {
        var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    })();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a></noscript>
</div>
</body>
</html>
